#  Собрать базовую схему компьютер - свитч - роутер - свитч - компьютер.


![[Pasted image 20241006122056.png]]


Для настройки роутера Cisco 2901 в [[Cisco Packet Tracer]] 8.2.2 для соединения двух компьютеров и двух коммутаторов, выполните следующие шаги:


### 1. Создание топологии

1. **Откройте Cisco Packet Tracer**.
2. **Добавьте устройства**:
   - Роутер Cisco 2901.
   - Два коммутатора (например, Cisco 2960).
   - Два компьютера (PC).

3. **Соедините устройства**:
   - Соедините каждый компьютер с одним из коммутаторов с помощью медных кабелей (Copper Straight-Through).
   - Соедините каждый коммутатор с роутером с помощью медных кабелей (Copper Straight-Through).

### 2. Настройка коммутаторов

Коммутаторы обычно не требуют сложной настройки, так как они работают на уровне 2 и автоматически обучаются MAC-адресам. Однако, если необходимо, можно настроить VLAN и другие параметры.

### 3. Настройка роутера

1. **Подключитесь к роутеру**:
   - Откройте консоль роутера.
   - Перейдите в режим привилегированного пользователя:
     ```shell
     Router> enable
     ```

2. **Настройте интерфейсы**:
   - Перейдите в режим глобальной конфигурации:
     ```shell
     Router# configure terminal
     ```
   - Настройте интерфейсы, подключенные к коммутаторам. Например, если интерфейсы GigabitEthernet0/0 и GigabitEthernet0/1 подключены к коммутаторам:
     ```shell
     Router(config)# interface GigabitEthernet0/0
     Router(config-if)# ip address 192.168.1.1 255.255.255.0
     Router(config-if)# no shutdown
     Router(config-if)# exit

     Router(config)# interface GigabitEthernet0/1
     Router(config-if)# ip address 192.168.2.1 255.255.255.0
     Router(config-if)# no shutdown
     Router(config-if)# exit
     ```

3. **Настройте маршрутизацию**:
   - Если необходимо, настройте статические маршруты или включите динамическую маршрутизацию (например, RIP, OSPF). Для простоты, настроим статические маршруты:
     ```shell
     Router(config)# ip route 192.168.2.0 255.255.255.0 192.168.1.1
     Router(config)# ip route 192.168.1.0 255.255.255.0 192.168.2.1
     ```

### 4. Настройка компьютеров

1. **Настройте IP-адреса**:
   - Откройте консоль каждого компьютера.
   - Настройте IP-адреса и шлюзы по умолчанию:
     - Для компьютера, подключенного к первому коммутатору:
       ```shell
       IP Address: 192.168.1.2
       Subnet Mask: 255.255.255.0
       Default Gateway: 192.168.1.1
       ```
     - Для компьютера, подключенного ко второму коммутатору:
       ```shell
       IP Address: 192.168.2.2
       Subnet Mask: 255.255.255.0
       Default Gateway: 192.168.2.1
       ```

### 5. Проверка соединения

1. **Проверьте соединение**:
   - С каждого компьютера попробуйте выполнить команду `ping` до другого компьютера:
     ```shell
     ping 192.168.2.2
     ```
     и
     ```shell
     ping 192.168.1.2
     ```

Если все настроено правильно, компьютеры должны успешно обмениваться данными через роутер.


![[Pasted image 20241006122105.png]]

# Сегментировать сеть на 10 и 20 vlan, добиться видимости хостов

Для сегментирования сети на VLAN 10 и 20 и обеспечения видимости хостов между этими VLAN, необходимо настроить коммутаторы и роутер. Вот пошаговая инструкция:

### 1. Настройка коммутаторов

1. **Настройка VLAN на коммутаторах**:
   - Подключитесь к каждому коммутатору и перейдите в режим глобальной конфигурации:
     ```shell
     Switch> enable
     Switch# configure terminal
     ```
   - Создайте VLAN 10 и 20:
     ```shell
     Switch(config)# vlan 10
     Switch(config-vlan)# name VLAN10
     Switch(config-vlan)# exit

     Switch(config)# vlan 20
     Switch(config-vlan)# name VLAN20
     Switch(config-vlan)# exit
     ```

2. **Назначьте порты коммутаторов в соответствующие VLAN**:
   - Например, если порт Fa0/1 подключен к компьютеру в VLAN 10, а порт Fa0/2 подключен к компьютеру в VLAN 20:
     ```shell
     Switch(config)# interface FastEthernet0/1
     Switch(config-if)# switchport mode access
     Switch(config-if)# switchport access vlan 10
     Switch(config-if)# exit

     Switch(config)# interface FastEthernet0/2
     Switch(config-if)# switchport mode access
     Switch(config-if)# switchport access vlan 20
     Switch(config-if)# exit
     ```

### 2. Настройка роутера

1. **Настройка интерфейсов роутера для VLAN**:
   - Подключитесь к роутеру и перейдите в режим глобальной конфигурации:
     ```shell
     Router> enable
     Router# configure terminal
     ```
   - Настройте интерфейсы для VLAN 10 и 20:
     ```shell
     Router(config)# interface GigabitEthernet0/0
     Router(config-subif)# ip address 192.168.10.1 255.255.255.0
     Router(config-subif)# exit

     Router(config)# interface GigabitEthernet0/1
     Router(config-subif)# ip address 192.168.20.1 255.255.255.0
     Router(config-subif)# exit
     ```

2. **Настройка маршрутизации между VLAN**:
   - Включите маршрутизацию между VLAN:
     ```shell
     Router(config)# ip routing
     ```

### 3. Настройка компьютеров

1. **Настройте IP-адреса компьютеров**:
   - Для компьютера в VLAN 10:
     ```shell
     IP Address: 192.168.10.2
     Subnet Mask: 255.255.255.0
     Default Gateway: 192.168.10.1
     ```
   - Для компьютера в VLAN 20:
     ```shell
     IP Address: 192.168.20.2
     Subnet Mask: 255.255.255.0
     Default Gateway: 192.168.20.1
     ```

### 4. Проверка соединения

1. **Проверьте соединение**:
   - С каждого компьютера попробуйте выполнить команду `ping` до другого компьютера:
     ```shell
     ping 192.168.20.2
     ```
     и
     ```shell
     ping 192.168.10.2
     ```

Если все настроено правильно, компьютеры должны успешно обмениваться данными между VLAN 10 и 20 через роутер.


# Настройка веб-сервера и NAT.


![[Pasted image 20241006122152.png]]


Для настройки веб-сервера и NAT на роутере в вашей сети Cisco Packet Tracer выполните следующие шаги:

### Шаг 1: Замена хоста на сервер

1. **Замените один из компьютеров на сервер**:
   - Удалите один из ПК и добавьте сервер (Server) из панели устройств.

### Шаг 2: Настройка веб-сервера

1. **Настройте IP-адрес на сервере**:
   - Установите IP-адрес сервера, например, 192.168.10.3 с маской 255.255.255.0.
   - Установите шлюз на 192.168.10.1 (IP-адрес роутера для VLAN 10).

2. **Настройте веб-сервер**:
   - Перейдите в настройки сервера.
   - Включите веб-сервер, выбрав вкладку **Services** и затем **HTTP**. Убедитесь, что служба включена.
   - Добавьте простую веб-страницу, например:
     - Нажмите на **HTTP** и введите текст, который будет отображаться на веб-странице.

### Шаг 3: Настройка NAT на роутере

1. **Перейдите в режим конфигурации роутера**:
   ```
   Router> enable
   Router# configure terminal
   ```

2. **Настройте NAT**:
   - Определите внутренний интерфейс (где находятся ваши локальные сети):
     ```
     Router(config)# interface gigabitethernet 0/0
     Router(config-if)# ip nat inside
     Router(config-if)# exit
     ```

   - Определите внешний интерфейс (интерфейс, подключенный к Интернету или внешней сети):
     ```
     Router(config)# interface gigabitethernet 0/1
     Router(config-if)# ip nat outside
     Router(config-if)# exit
     ```

3. **Настройте NAT для доступа к веб-серверу**:
   - Создайте NAT-перевод для внутреннего адреса сервера:
     ```
     Router(config)# ip nat inside source static tcp 192.168.10.3 80 <NAT_IP> 80
     ```
   - Замените `<NAT_IP>` на IP-адрес, который будет использоваться для доступа к серверу извне (например, 203.0.113.1).

### Шаг 4: Проверка доступа к веб-серверу

1. **Проверьте доступ к веб-серверу**:
   - Используйте веб-браузер на другом компьютере или устройстве в вашей сети, чтобы ввести NAT IP-адрес (например, `http://203.0.113.1`).
   - Вы должны увидеть веб-страницу, которую вы настроили на сервере.

### Заключение

Теперь у вас должен быть настроенный веб-сервер, доступный через NAT. Убедитесь, что все настройки выполнены правильно, и проверьте доступ к веб-странице.


